CSI API ETABS v1
eAreaDesignOrientation Enumeration
 The possible design orientations for a shell.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eAreaDesignOrientation
Public Enumeration eAreaDesignOrientation
Dim instance As eAreaDesignOrientation
public enum class eAreaDesignOrientation
type eAreaDesignOrientation
Members
Member name | Value | Description
Wall | 1
Floor | 2
Ramp_DO_NOT_USE | 3
Null | 4
Other | 5
Remarks
See Also
Reference
ETABSv1 Namespace